CREATE DATABASE IF NOT EXISTS book_store_db;

CREATE TABLE IF NOT EXISTS book_store_db.list_of_books (
	N		int,
	Code		int,
	New		varchar(20),
	Title		varchar(255),
	Price		varchar(20),
	Publisher	varchar(255),
	Pages		int,
	Format		varchar(20),
	Date		varchar(20),
	Edition		int,
	Topic		varchar(255),
	Category	varchar(255)
);

INSERT INTO book_store_db.list_of_books (N, Code, New, Title, Price, Publisher, Pages, Format, Date, Edition, Topic, Category) VALUES
(2,5110,'No','Апаратні засоби мультимедіа. ВідеосисTopic РС','$15.51','Видавнича група BHV',400,'70х100/16','07/24/2000',5000,'Використання ПК в цілому','Підручники'),
(8,4985,'No','Засвой самостійно модернізацію та ремонт ПК за 24 години, 2-ге вид.','$18.90','Вільямс',288,'70х100/16','07/07/2000',5000,'Використання ПК в цілому','Підручники'),
(9,5141,'No','Структури даних та алгоритми','$37.80','Вільямс',384,'70х100/16','9/29/2000',5000,'Використання ПК в цілому','Підручники'),
(20,5127,'No','Автоматизація інженерно-графічних робіт','$11.58','Видавнича група BHV',256,'70х100/16','6/15/2000',5000,'Використання ПК в цілому','Підручники'),
(31,5110,'No','Апаратні засоби мультимедіа. ВідеосисTopic РС','$15.51','Видавнича група BHV',400,'70х100/16','07/24/2000',5000,'Використання ПК в цілому','Апаратні засоби ПК'),
(46,5199,'No','Залізо IBM 2001','$30.07','МикроАрт',368,'70х100/16','12/02/2000',5000,'Використання ПК в цілому','Апаратні засоби ПК'),
(50,3851,'No','Захист інформації та безпека комп`ютерних систем','$26.00','DiaSoft',480,'84х108/16',NULL,5000,'Використання ПК в цілому','Захист і безпека ПК'),
(58,3932,'No','Як перетворити персональний комп`ютер на вимірювальний комплекс','$7.65','ДМК',144,'60х88/16','06/09/1999',5000,'Використання ПК в цілому','Інші книги'),
(59,4713,'No','Plug-ins. Додаткові програми для музичних програм','$11.41','ДМК',144,'70х100/16','02/22/2000',5000,'Використання ПК в цілому','Інші книги'),
(175,5217,'No',' Windows МЕ. Найновіші версії програм','$16.57','Триумф',320,'70х100/16','08/25/2000',5000,'Операційні системи','Windows 2000'),
(176,4829,'No','Windows 2000 Professional крок за кроком з CD','$27.25','Эком',320,'70х100/16','04/28/2000',5000,'Операційні системи','Windows 2000'),
(188,5170,'No','Linux версії','$24.43','ДМК',346,'70х100/16','09/29/2000',5000,'Операційні системи','Linux'),
(191,860,'No','Операційна сисTopic UNIX','$3.50','Видавнича група BHV',395,'84х100\16','05/05/1997',5000,'Операційні системи','Unix'),
(203,44,'No','Відповіді на актуальні запитання щодо OS/2 Warp','$5.00','DiaSoft',352,'60х84/16','03/20/1996',5000,'Операційні системи','Інші операційні системи'),
(206,5176,'No','Windows Ме. Супутник користувача','$12.79','Видавнича група BHV',306,NULL,'10/10/2000',5000,'Операційні системи','Інші операційні системи'),
(209,5462,'No','Мова програмування С++. Лекції та вправи','$29.00','DiaSoft',656,'84х108/16','12/12/2000',5000,'Програмування','C&C++'),
(210,4982,'No','Мова програмування С. Лекції та вправи','$29.00','DiaSoft',432,'84х108/16','07/12/2000',5000,'Програмування','C&C++'),
(220,4687,'No','Ефективне використання C++ .50 рекомендацій щодо покращення ваших програм та проектів ','$17.60','ДМК',240,'70х100/16','02/03/2000',5000,'Програмування','C&C++'),
(222,235,'No','Інформаційні системи і структури даних',NULL,'Києво-Могилянська академія',288,'60х90/16',NULL,400,'Використання ПК в цілому','Інші книги'),
(225,8746,'Yes','Бази даних в інформаційних сисTopicх',NULL,'Університет "Україна"',418,'60х84/16','25/07/2018',100,'Програмування','SQL'),
(226,2154,'Yes','Сервер на основі операційної системи FreeBSD 6.1','0','Університет "Україна"',216,'60х84/16','03/11/2015',500,'Програмування','Інші операційні системи'),
(245,2662,'No','Організація баз даних та знань','0','Вінниця: ВДТУ',208,'60х90/16','10/10/2001',1000,'Програмування','SQL'),
(247,5641,'Yes','Організація баз даних та знань','0','Видавнича група BHV',384,'70х100/16','15/12/2021',5000,'Програмування','SQL');

DROP DATABASE IF EXISTS book_store_db;

CREATE DATABASE IF NOT EXISTS book_store_V2_db;

CREATE TABLE IF NOT EXISTS book_store_V2_db.list_of_books (
	N 		int NOT NULL,
	Code 		int NOT NULL,
	New		varchar(20) NOT NULL,
	Title		varchar(255) NOT NULL,
	Price		varchar(20) DEFAULT '0',
	Publisher	varchar(255) NOT NULL,
	Pages		int NOT NULL,
	Format		varchar(20) NULL,
	Date		varchar(20) NULL,
	Edition		int NOT NULL,
	Topic		varchar(255) NOT NULL,
	Category	varchar(255) NOT NULL,
	PRIMARY KEY (N),
	CHECK (N>0 AND Code>0 AND Pages>0 AND Edition>0)
);

CREATE INDEX category_index 
ON book_store_V2_db.list_of_books (Category);

INSERT INTO book_store_V2_db.list_of_books (N, Code, New, Title, Price, Publisher, Pages, Format, Date, Edition, Topic, Category) VALUES
(2,5110,'No','Апаратні засоби мультимедіа. ВідеосисTopic РС','$15.51','Видавнича група BHV',400,'70х100/16','07/24/2000',5000,'Використання ПК в цілому','Підручники'),
(8,4985,'No','Засвой самостійно модернізацію та ремонт ПК за 24 години, 2-ге вид.','$18.90','Вільямс',288,'70х100/16','07/07/2000',5000,'Використання ПК в цілому','Підручники'),
(9,5141,'No','Структури даних та алгоритми','$37.80','Вільямс',384,'70х100/16','9/29/2000',5000,'Використання ПК в цілому','Підручники'),
(20,5127,'No','Автоматизація інженерно-графічних робіт','$11.58','Видавнича група BHV',256,'70х100/16','6/15/2000',5000,'Використання ПК в цілому','Підручники'),
(31,5110,'No','Апаратні засоби мультимедіа. ВідеосисTopic РС','$15.51','Видавнича група BHV',400,'70х100/16','07/24/2000',5000,'Використання ПК в цілому','Апаратні засоби ПК'),
(46,5199,'No','Залізо IBM 2001','$30.07','МикроАрт',368,'70х100/16','12/02/2000',5000,'Використання ПК в цілому','Апаратні засоби ПК'),
(50,3851,'No','Захист інформації та безпека комп`ютерних систем','$26.00','DiaSoft',480,'84х108/16',NULL,5000,'Використання ПК в цілому','Захист і безпека ПК'),
(58,3932,'No','Як перетворити персональний комп`ютер на вимірювальний комплекс','$7.65','ДМК',144,'60х88/16','06/09/1999',5000,'Використання ПК в цілому','Інші книги'),
(59,4713,'No','Plug-ins. Додаткові програми для музичних програм','$11.41','ДМК',144,'70х100/16','02/22/2000',5000,'Використання ПК в цілому','Інші книги'),
(175,5217,'No',' Windows МЕ. Найновіші версії програм','$16.57','Триумф',320,'70х100/16','08/25/2000',5000,'Операційні системи','Windows 2000'),
(176,4829,'No','Windows 2000 Professional крок за кроком з CD','$27.25','Эком',320,'70х100/16','04/28/2000',5000,'Операційні системи','Windows 2000'),
(188,5170,'No','Linux версії','$24.43','ДМК',346,'70х100/16','09/29/2000',5000,'Операційні системи','Linux'),
(191,860,'No','Операційна сисTopic UNIX','$3.50','Видавнича група BHV',395,'84х100\16','05/05/1997',5000,'Операційні системи','Unix'),
(203,44,'No','Відповіді на актуальні запитання щодо OS/2 Warp','$5.00','DiaSoft',352,'60х84/16','03/20/1996',5000,'Операційні системи','Інші операційні системи'),
(206,5176,'No','Windows Ме. Супутник користувача','$12.79','Видавнича група BHV',306,NULL,'10/10/2000',5000,'Операційні системи','Інші операційні системи'),
(209,5462,'No','Мова програмування С++. Лекції та вправи','$29.00','DiaSoft',656,'84х108/16','12/12/2000',5000,'Програмування','C&C++'),
(210,4982,'No','Мова програмування С. Лекції та вправи','$29.00','DiaSoft',432,'84х108/16','07/12/2000',5000,'Програмування','C&C++'),
(220,4687,'No','Ефективне використання C++ .50 рекомендацій щодо покращення ваших програм та проектів ','$17.60','ДМК',240,'70х100/16','02/03/2000',5000,'Програмування','C&C++'),
(222,235,'No','Інформаційні системи і структури даних',NULL,'Києво-Могилянська академія',288,'60х90/16',NULL,400,'Використання ПК в цілому','Інші книги'),
(225,8746,'Yes','Бази даних в інформаційних сисTopicх',NULL,'Університет "Україна"',418,'60х84/16','25/07/2018',100,'Програмування','SQL'),
(226,2154,'Yes','Сервер на основі операційної системи FreeBSD 6.1','0','Університет "Україна"',216,'60х84/16','03/11/2015',500,'Програмування','Інші операційні системи'),
(245,2662,'No','Організація баз даних та знань','0','Вінниця: ВДТУ',208,'60х90/16','10/10/2001',1000,'Програмування','SQL'),
(247,5641,'Yes','Організація баз даних та знань','0','Видавнича група BHV',384,'70х100/16','15/12/2021',5000,'Програмування','SQL');

ALTER TABLE book_store_V2_db.list_of_books 
ADD Author varchar(15);

ALTER TABLE book_store_V2_db.list_of_books
MODIFY COLUMN Author varchar(20);

ALTER TABLE book_store_V2_db.list_of_books
DROP COLUMN Author;

CREATE UNIQUE INDEX N_index 
ON book_store_V2_db.list_of_books (N);

SELECT * FROM book_store_V2_db.list_of_books 
ORDER BY N;

DROP INDEX N_index 
ON book_store_V2_db.list_of_books;
